src/InformationRegisters/ксИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ксИнформационныеБазы</Name>
			<Comment>DEV-12001</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>descr</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>infobase</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кластер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ксИнформационныеБазы/Ext/ManagerModule.bsl
Процедура ЗаписатьИнформационныеБазы(ТаблицаСеансов, Кластер) Экспорт
	
	Для каждого ТекСтрока из ТаблицаСеансов Цикл
		Если ЗначениеЗаполнено(ТекСтрока.infobase) Тогда
			МЗ = РегистрыСведений.ксИнформационныеБазы.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ,ТекСтрока); 
			МЗ.infobase = Новый УникальныйИдентификатор(ТекСтрока.infobase);
			МЗ.Кластер = Кластер;
			МЗ.Записать();	
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры
